In [1]:
import pandas as pd
import numpy as np

In [2]:
from numpy.random import randn
np.random.seed(101) # random sürekli olarak aynı değerleri döndürecektir.
df=pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [3]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [4]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [5]:
df[['W']]

          W
A  2.706850
B  0.651118
C -2.018168
D  0.188695
E  0.190794

In [6]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [7]:
type(df['W'])

pandas.core.series.Series

In [8]:
df['new']=df['W']+df['Y']

In [9]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [10]:
df.drop('new',axis=1) #axis=0 satır, axis=1 sütun

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [11]:
df = pd.DataFrame({'A': [1,2,1,3,4,2,5,4,6,7,2,3]})
df

    A
0   1
1   2
2   1
3   3
4   4
5   2
6   5
7   4
8   6
9   7
10  2
11  3

In [12]:
df.drop_duplicates(subset='A') #aynı elemanları siler

   A
0  1
1  2
3  3
4  4
6  5
8  6
9  7

In [13]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3] 
hier_index = list(zip(outside,inside)) #birden çok listeyi birleştirdik.

print hier_index

hier_index = pd.MultiIndex.from_tuples(hier_index) #çoklu label için satır ve sütun oluşturdu.

hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

MultiIndex(levels=[[u'G1', u'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [14]:
df = pd.DataFrame(randn(6,2),index=hier_index, columns=['A','B'])
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [15]:
df.xs('G1') #G1 indexini alır

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [16]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[np.nan,4,np.nan],
                  'C':[5,2,3],
                  'D':[np.nan,5,np.nan]})
df

     A    B  C    D
0  1.0  NaN  5  NaN
1  2.0  4.0  2  5.0
2  NaN  NaN  3  NaN

In [17]:
df.dropna() #nan içermeyen değerleri getirir.

     A    B  C    D
1  2.0  4.0  2  5.0

In [18]:
df.dropna(axis=1) #sütun başında nan içermeyen değerleri getirir.

   C
0  5
1  2
2  3

In [19]:
df.dropna(thresh=2) #thresh miktarından az nan değerleri alır.

     A    B  C    D
0  1.0  NaN  5  NaN
1  2.0  4.0  2  5.0

In [20]:
df.fillna(value='boş')

     A    B  C    D
0    1  boş  5  boş
1    2    4  2    5
2  boş  boş  3  boş

In [21]:
df['A'].fillna(value=df['A'].mean()) #eksik veriye A sütunun ortalamasını ekledik.

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [22]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350],
        'Sales2':[200,120,340,124,243,400]}

In [23]:
type(data)

dict

In [24]:
df = pd.DataFrame(data)
df

  Company   Person  Sales  Sales2
0    GOOG      Sam    200     200
1    GOOG  Charlie    120     120
2    MSFT      Amy    340     340
3    MSFT  Vanessa    124     124
4      FB     Carl    243     243
5      FB    Sarah    350     400

In [25]:
by_comp = df.groupby('Company')
by_comp.mean()

         Sales  Sales2
Company
FB       296.5   321.5
GOOG     160.0   160.0
MSFT     232.0   232.0

In [26]:
by_comp.std() #standart sapma

              Sales      Sales2
Company
FB        75.660426  111.015765
GOOG      56.568542   56.568542
MSFT     152.735065  152.735065

In [27]:
by_comp.min() #minimum değer

          Person  Sales  Sales2
Company
FB          Carl    243     243
GOOG     Charlie    120     120
MSFT         Amy    124     124

In [28]:
by_comp.max() #maximum değer

          Person  Sales  Sales2
Company
FB         Sarah    350     400
GOOG         Sam    200     200
MSFT     Vanessa    340     340

In [29]:
by_comp.count() #grubun kaç elemanı var

         Person  Sales  Sales2
Company
FB            2      2       2
GOOG          2      2       2
MSFT          2      2       2

In [30]:
by_comp.describe() #Tüm özelikleri tablo olarak listeler.

        Sales                                                         Sales2  \
        count   mean         std    min     25%    50%     75%    max  count
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0    2.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0    2.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0    2.0


          mean         std    min     25%    50%     75%    max
Company
FB       321.5  111.015765  243.0  282.25  321.5  360.75  400.0
GOOG     160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT     232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [31]:
by_comp.describe().T

Company               FB        GOOG        MSFT
Sales  count    2.000000    2.000000    2.000000
       mean   296.500000  160.000000  232.000000
       std     75.660426   56.568542  152.735065
       min    243.000000  120.000000  124.000000
       25%    269.750000  140.000000  178.000000
       50%    296.500000  160.000000  232.000000
       75%    323.250000  180.000000  286.000000
       max    350.000000  200.000000  340.000000
Sales2 count    2.000000    2.000000    2.000000
       mean   321.500000  160.000000  232.000000
       std    111.015765   56.568542  152.735065
       min    243.000000  120.000000  124.000000
       25%    282.250000  140.000000  178.000000
       50%    321.500000  160.000000  232.000000
       75%    360.750000  180.000000  286.000000
       max    400.000000  200.000000  340.000000

In [32]:
df1 = pd.DataFrame({'A':['A0','A1','A2','A3'],
                   'B':['B0','B1','B2','B3'],
                   'C':['C0','C1','C2','C3'],
                   'D':['D0','D1','D2','D3']})

In [33]:
df2 = pd.DataFrame({'A':['A4','A5','A6','A7'],
                   'B':['B4','B5','B6','B7'],
                   'C':['C4','C5','C6','C7'],
                   'D':['D4','D5','D6','D7']},
                  index=[4,5,6,7])

In [34]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [35]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [36]:
pd.concat([df1,df2],axis=0,ignore_index=True) #Dataframe'leri dikey birleştirir.

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [37]:
pd.concat([df1,df2],axis=1) #Dataframe'leri yatay birleştirir.

     A    B    C    D    A    B    C    D
0   A0   B0   C0   D0  NaN  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN  NaN
2   A2   B2   C2   D2  NaN  NaN  NaN  NaN
3   A3   B3   C3   D3  NaN  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN   A4   B4   C4   D4
5  NaN  NaN  NaN  NaN   A5   B5   C5   D5
6  NaN  NaN  NaN  NaN   A6   B6   C6   D6
7  NaN  NaN  NaN  NaN   A7   B7   C7   D7

In [38]:
left = pd.DataFrame({'key':['K0','K1','K2','K3'],
                    'A':['A0','A1','A2','A3'],
                    'B':['B0','B1','B2','B3']})

In [39]:
right = pd.DataFrame({'key':['K0','K1','K2','K3'],
                    'C':['C0','C1','C2','C3'],
                    'D':['D0','D1','D2','D3']})

In [40]:
left

    A   B key
0  A0  B0  K0
1  A1  B1  K1
2  A2  B2  K2
3  A3  B3  K3

In [41]:
right

    C   D key
0  C0  D0  K0
1  C1  D1  K1
2  C2  D2  K2
3  C3  D3  K3

In [42]:
pd.merge(left,right,how='inner',on='key')

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

In [43]:
left = pd.DataFrame({'key1':['K0','K0','K1','K0'],
                    'key2':['K0','K1','K0','K1'],
                    'A':['A0','A1','A2','A3'],
                    'B':['B0','B1','B2','B3']})

In [44]:
right = pd.DataFrame({'key1':['K0','K1','K1','K0'],
                    'key2':['K0','K0','K0','K0'],
                    'C':['C0','C1','C2','C3'],
                    'D':['D0','D1','D2','D3']})

In [45]:
left

    A   B key1 key2
0  A0  B0   K0   K0
1  A1  B1   K0   K1
2  A2  B2   K1   K0
3  A3  B3   K0   K1

In [46]:
right

    C   D key1 key2
0  C0  D0   K0   K0
1  C1  D1   K1   K0
2  C2  D2   K1   K0
3  C3  D3   K0   K0

In [47]:
pd.merge(left,right,on=['key1','key2'])

    A   B key1 key2   C   D
0  A0  B0   K0   K0  C0  D0
1  A0  B0   K0   K0  C3  D3
2  A2  B2   K1   K0  C1  D1
3  A2  B2   K1   K0  C2  D2

In [48]:
pd.merge(left,right,how='outer',on=['key1','key2'])

    A   B key1 key2    C    D
0  A0  B0   K0   K0   C0   D0
1  A0  B0   K0   K0   C3   D3
2  A1  B1   K0   K1  NaN  NaN
3  A3  B3   K0   K1  NaN  NaN
4  A2  B2   K1   K0   C1   D1
5  A2  B2   K1   K0   C2   D2

In [49]:
pd.merge(left,right,how='right',on=['key1','key2'])

    A   B key1 key2   C   D
0  A0  B0   K0   K0  C0  D0
1  A0  B0   K0   K0  C3  D3
2  A2  B2   K1   K0  C1  D1
3  A2  B2   K1   K0  C2  D2

In [50]:
pd.merge(left,right,how='left',on=['key1','key2'])

    A   B key1 key2    C    D
0  A0  B0   K0   K0   C0   D0
1  A0  B0   K0   K0   C3   D3
2  A1  B1   K0   K1  NaN  NaN
3  A2  B2   K1   K0   C1   D1
4  A2  B2   K1   K0   C2   D2
5  A3  B3   K0   K1  NaN  NaN

In [51]:
left = pd.DataFrame({'A':['A0','A1','A2','A3'],
                    'B':['B0','B1','B2','B3']},
                    index=['K0','K1','K2','K3'])

In [52]:
right = pd.DataFrame({'C':['C0','C1','C2','C3'],
                    'D':['D0','D1','D2','D3']},
                    index=['K0','K1','K2','K3'])

In [53]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2
K3  A3  B3

In [54]:
right

     C   D
K0  C0  D0
K1  C1  D1
K2  C2  D2
K3  C3  D3

In [55]:
left.join(right) #left dataframe'ine right datafram'ini ekler.

     A   B   C   D
K0  A0  B0  C0  D0
K1  A1  B1  C1  D1
K2  A2  B2  C2  D2
K3  A3  B3  C3  D3

In [56]:
df = pd.DataFrame({'col1':[1,2,3,4],
                  'col2':[444,555,666,444],
                  'col3':['abc','def','ghi','xyz']})

In [57]:
df.head() #Dataframe'in ilk 5 satırını gösterir.

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [58]:
df.tail() #Dataframe'in son 5 satırını gösterir.

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [59]:
df['col2'].unique() #Farlı değerleri listeler.

array([444, 555, 666])

In [60]:
df['col2'].nunique() #Kaç adet faklıdeğer olduğunu verir.

3

In [61]:
df['col2'].value_counts() #hangi değerneden kaç adet olduğunu verir.

444    2
555    1
666    1
Name: col2, dtype: int64

In [62]:
newdf = df[(df['col1']>2) & (df['col2']==444)]
newdf

   col1  col2 col3
3     4   444  xyz

In [63]:
def times2(x):
    return x**2

In [64]:
df['col1'].apply(times2) #Tüm elemanları fonksiyona gönderir.

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [65]:
df['col3'].apply(len) #elemanlarının uzunluklarını verir.

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [66]:
df['col1'].sum() #elemanların toplamını verir.

10

In [67]:
df['col1'].max()

4

In [68]:
df.columns

Index([u'col1', u'col2', u'col3'], dtype='object')

In [69]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [70]:
df.sort_values(by='col2') #col2'ye göre sıralama yapar.

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [71]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                  'col2':[np.nan,555,666,444],
                  'col3':['abc','def','ghi','xyz']})
df

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [72]:
df.isnull() #null eleman var mı kontrol eder.

    col1   col2   col3
0  False   True  False
1  False  False  False
2  False  False  False
3   True  False  False

In [73]:
df.dropna() #null olmayan satırları gösterir.

   col1   col2 col3
1   2.0  555.0  def
2   3.0  666.0  ghi

In [74]:
df = pd.DataFrame({'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
                   'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
                   'Sales':[200,120,340,124,243,350],
                    'Sales2':[200,120,340,124,243,400]},
                    index=['K0','K1','K2','K3','K4','K5'])
df

   Company   Person  Sales  Sales2
K0    GOOG      Sam    200     200
K1    GOOG  Charlie    120     120
K2    MSFT      Amy    340     340
K3    MSFT  Vanessa    124     124
K4      FB     Carl    243     243
K5      FB    Sarah    350     400

In [75]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, K0 to K5
Data columns (total 4 columns):
Company    6 non-null object
Person     6 non-null object
Sales      6 non-null int64
Sales2     6 non-null int64
dtypes: int64(2), object(2)
memory usage: 240.0+ bytes

In [76]:
df[:2]

   Company   Person  Sales  Sales2
K0    GOOG      Sam    200     200
K1    GOOG  Charlie    120     120

In [77]:
df.iloc[:2]

   Company   Person  Sales  Sales2
K0    GOOG      Sam    200     200
K1    GOOG  Charlie    120     120

In [78]:
df.head(2)

   Company   Person  Sales  Sales2
K0    GOOG      Sam    200     200
K1    GOOG  Charlie    120     120

In [79]:
df.loc['K1':,['Company','Person']]

   Company   Person
K1    GOOG  Charlie
K2    MSFT      Amy
K3    MSFT  Vanessa
K4      FB     Carl
K5      FB    Sarah

In [80]:
df.loc[['K2','K3'],['Company','Person']]

   Company   Person
K2    MSFT      Amy
K3    MSFT  Vanessa

In [81]:
df[['Company','Person']]

   Company   Person
K0    GOOG      Sam
K1    GOOG  Charlie
K2    MSFT      Amy
K3    MSFT  Vanessa
K4      FB     Carl
K5      FB    Sarah

In [82]:
df.index[[2,3]]

Index([u'K2', u'K3'], dtype='object')

In [83]:
df[df['Sales'].between(100,200)]

   Company   Person  Sales  Sales2
K0    GOOG      Sam    200     200
K1    GOOG  Charlie    120     120
K3    MSFT  Vanessa    124     124

In [84]:
df['Person'].map({'Sam':True,'Amy':False})

K0     True
K1      NaN
K2    False
K3      NaN
K4      NaN
K5      NaN
Name: Person, dtype: object

In [85]:
df['Person'] = df['Person'].replace(['Sam','Charlie','Carl'],'Amy')
df

   Company   Person  Sales  Sales2
K0    GOOG      Amy    200     200
K1    GOOG      Amy    120     120
K2    MSFT      Amy    340     340
K3    MSFT  Vanessa    124     124
K4      FB      Amy    243     243
K5      FB    Sarah    350     400

In [86]:
df.pivot_table(index='Person', columns='Company', values='Sales', aggfunc='mean')

Company     FB   GOOG   MSFT
Person
Amy      243.0  160.0  340.0
Sarah    350.0    NaN    NaN
Vanessa    NaN    NaN  124.0

In [87]:
df = pd.DataFrame(np.random.randn(10, 2),
                  columns=['Col1', 'Col2'])

df['X'] = pd.Series(['A', 'A', 'A', 'A', 'A',
                      'B', 'B', 'B', 'B', 'B'])

#data icerisindeki median dağılımını gösterir. (max, 75%,orta nokta, 25%, max) 
#1.5*(orta nokta - 75%) ayrık noktayı verir. örneğin [1 1 1 1000] dizinde ayrık nokta 1000 değeridir.
df.boxplot(by='X') 
#df.boxplot(column='Col1')
df.boxplot(column='Col1',by='X')

In [88]:
df = pd.DataFrame(np.random.randn(10, 2),
                  columns=['Col1', 'Col2'])

df['X'] = pd.Series(['A', 'B', 'C', 'D', 'E',
                      'A2', 'B2', 'C2', 'D2', 'E2'])

df.head()

       Col1      Col2  X
0  0.147027 -0.479448  A
1  0.558769  1.024810  B
2 -0.925874  1.862864  C
3 -1.133817  0.610478  D
4  0.386030  2.084019  E

In [89]:
melted = pd.melt(frame=df.head(), id_vars = 'X', value_vars= ['Col1','Col2']) #data columlarını birleştirme için kullanılır.
melted

   X variable     value
0  A     Col1  0.147027
1  B     Col1  0.558769
2  C     Col1 -0.925874
3  D     Col1 -1.133817
4  E     Col1  0.386030
5  A     Col2 -0.479448
6  B     Col2  1.024810
7  C     Col2  1.862864
8  D     Col2  0.610478
9  E     Col2  2.084019

In [90]:
melted.pivot(index = 'X', columns = 'variable',values='value') #birleştirilen colum'ları ayrımak için kullanılır. 
#data nameleri ('X') içerisinde tekrarlayan veriler bulunmamalıdır.

variable      Col1      Col2
X
A         0.147027 -0.479448
B         0.558769  1.024810
C        -0.925874  1.862864
D        -1.133817  0.610478
E         0.386030  2.084019

In [91]:
df.info()
df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
Col1    10 non-null float64
Col2    10 non-null float64
X       10 non-null object
dtypes: float64(2), object(1)
memory usage: 312.0+ bytes

       Col1      Col2  X
0  0.147027 -0.479448  A
1  0.558769  1.024810  B
2 -0.925874  1.862864  C
3 -1.133817  0.610478  D
4  0.386030  2.084019  E

In [92]:
df.Col1 = df.Col1.astype('category') #değişken türleri değiştirilebilir.
df.Col2 = df.Col2.astype('int')
df.info()
df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
Col1    10 non-null category
Col2    10 non-null int64
X       10 non-null object
dtypes: category(1), int64(1), object(1)
memory usage: 642.0+ bytes

       Col1  Col2  X
0  0.147027     0  A
1  0.558769     1  B
2 -0.925874     1  C
3 -1.133817     0  D
4  0.386030     2  E

In [93]:
dic = {"treatment":["A","A","B","B"],"gender":["F","M","F","M"],"response":[10,45,5,9],"age":[15,4,72,65]}
df = pd.DataFrame(dic)
df

   age gender  response treatment
0   15      F        10         A
1    4      M        45         A
2   72      F         5         B
3   65      M         9         B

In [94]:
df.pivot(index="treatment",columns = "gender",values="response")

gender      F   M
treatment
A          10  45
B           5   9

In [95]:
df1 = df.set_index(["treatment","gender"])
df1

                  age  response
treatment gender
A         F        15        10
          M         4        45
B         F        72         5
          M        65         9

In [96]:
df1.unstack(level=0)

          age     response
treatment   A   B        A  B
gender
F          15  72       10  5
M           4  65       45  9

In [97]:
df1.unstack(level=1)

          age     response
gender      F   M        F   M
treatment
A          15   4       10  45
B          72  65        5   9

In [98]:
df2 = df1.swaplevel(0,1)
df2

                  age  response
gender treatment
F      A           15        10
M      A            4        45
F      B           72         5
M      B           65         9

# Referans Link

## https://pandas.pydata.org/pandas-docs/stable/tutorials.html